InformationRegisters/ВидыДокументовГосОргановДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВидыДокументовГосОргановДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПолучателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтролирующихОрганов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтправляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодДокумента</Name>
					<Comment>КНД, код по ОКУД</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Синонимы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонцаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяВидаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыОтправляемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыОтправляемыхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолучателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтролирующихОрганов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтправляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВидыДокументовГосОргановДляПоиска/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СвойстваВидовДокументовГосОргановДляПоиска() Экспорт
	
	РезультатСоответствие = Новый Соответствие;
	
	// Получим макет со списком документов.
	МакетСписокДокументов = РегистрыСведений.ВидыДокументовГосОргановДляПоиска.ПолучитьМакет(
		"ОписаниеВидовДокументовГосОргановДляПоиска");
	
	Для ИндексОбласти = 0 По МакетСписокДокументов.Области.Количество() - 1 Цикл
		ТекОбласть = МакетСписокДокументов.Области[ИндексОбласти];
		
		Для НомерСтроки = ТекОбласть.Верх + 1 По ТекОбласть.Низ Цикл
			
			// перебираем элементы второго уровня
			ИмяЭлемента = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 1).Текст);
			
			СтруктураСвойствЭлемента = ШаблонСвойствВидаДокументовГосОргановДляПоиска();
			СтруктураСвойствЭлемента.Наименование = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 2).Текст);
			СтруктураСвойствЭлемента.Описание = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 3).Текст);
			СтруктураСвойствЭлемента.Источник = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 4).Текст);
			СтруктураСвойствЭлемента.ТипПолучателя = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 5).Текст);
			СтруктураСвойствЭлемента.ТипДокумента = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 6).Текст);
			СтруктураСвойствЭлемента.КодДокумента = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 7).Текст);
			СтруктураСвойствЭлемента.Синонимы = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 8).Текст);
			СтруктураСвойствЭлемента.ДатаНачалаДействия = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 9).Текст);
			СтруктураСвойствЭлемента.ДатаКонцаДействия = СокрЛП(МакетСписокДокументов.Область(НомерСтроки, 10).Текст);
			
			РезультатСоответствие.Вставить(ИмяЭлемента, СтруктураСвойствЭлемента);
		КонецЦикла;
	КонецЦикла;
	
	Возврат РезультатСоответствие;
	
КонецФункции

// Шаблон свойств вида документа для поиска.
// Может использоваться в процедуре "ВидыДокументовГосОргановДляПоиска" общего модуля
// "ДокументооборотСКОПереопределяемый".
//
// Возвращаемое значение:
//  Структура.
//
Функция ШаблонСвойствВидаДокументовГосОргановДляПоиска() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Описание", "");
	Результат.Вставить("Источник", "");
	Результат.Вставить("ТипПолучателя", Неопределено);
	Результат.Вставить("ТипДокумента", Неопределено);
	Результат.Вставить("КодДокумента", "");
	Результат.Вставить("Синонимы", "");
	Результат.Вставить("ДатаНачалаДействия", '00010101');
	Результат.Вставить("ДатаКонцаДействия", '00010101');
	
	Возврат Результат;
	
КонецФункции

Функция КодВидаОтправляемогоДокументаИлиИсточника() Экспорт
	
	Результат = Новый Соответствие;
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Если КонтекстЭДОСервер = Неопределено Тогда
		МакетКНД = Обработки.ДокументооборотСКонтролирующимиОрганами.ПолучитьМакет("ОписаниеФормДляИмпорта");
		МакетФормСтатистики = Обработки.ДокументооборотСКонтролирующимиОрганами.ПолучитьМакет("ОписаниеФормДляИмпортаФСГС");
	Иначе
		МакетКНД = КонтекстЭДОСервер.ПолучитьМакет("ОписаниеФормДляИмпорта");
		МакетФормСтатистики = КонтекстЭДОСервер.ПолучитьМакет("ОписаниеФормДляИмпортаФСГС");
	КонецЕсли;
	
	Для Инд = 1 По МакетКНД.ВысотаТаблицы Цикл
		КНДВМакете = СокрЛП(МакетКНД.Область(Инд, 1, Инд, 1).Текст);
		ИмяПредопределенногоВМакете = СокрЛП(МакетКНД.Область(Инд, 2, Инд, 2).Текст);
		Результат[ИмяПредопределенногоВМакете] = Новый Структура("КНД, КодПоОКУД", КНДВМакете, "");
	КонецЦикла;
	
	Для Инд = 2 По МакетФормСтатистики.ВысотаТаблицы Цикл
		СтрКодПоОКУД = СокрЛП(МакетФормСтатистики.Область(Инд, 1, Инд, 1).Текст);
		Если НЕ ЗначениеЗаполнено(СтрКодПоОКУД) Тогда
			Продолжить;
		КонецЕсли;
		СтрИсточникОтчета = СокрЛП(МакетФормСтатистики.Область(Инд, 3, Инд, 3).Текст);
		ЭлементРезультата = Результат[СтрИсточникОтчета];
		Если ЭлементРезультата = Неопределено Тогда
			ЭлементРезультата = Новый Структура("КНД, КодПоОКУД", "", "");
		КонецЕсли;
		ЭлементРезультата.КодПоОКУД = Прав("0000000" + СтрКодПоОКУД, 7);
		Результат[СтрИсточникОтчета] = ЭлементРезультата;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьВидыДокументовГосОргановДляПоиска(ЗаполнитьЦеликом = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеСвойствВидовОтправляемыхДокументов =
		Справочники.ВидыОтправляемыхДокументов.ПолучитьСоответствиеСвойствВидовОтправляемыхДокументов(, Истина);
	СоответствиеСвойств = СвойстваВидовДокументовГосОргановДляПоиска();
	ПереопределениеСвойств = Новый Соответствие;
	ДокументооборотСКОПереопределяемый.ВидыДокументовГосОргановДляПоиска(ПереопределениеСвойств);
	ОписаниеТипаИмяВидаДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	ВидыДокументовДляПоискаИзМакета = Новый ТаблицаЗначений;
	ВидыДокументовДляПоискаИзМакета.Колонки.Добавить("ИмяВидаДокумента", ОписаниеТипаИмяВидаДокумента);
	Для каждого ЭлементСоответствия Из СоответствиеСвойствВидовОтправляемыхДокументов Цикл
		Если ЗначениеЗаполнено(ЭлементСоответствия.Ключ) Тогда
			ВидДокументовДляПоискаИзМакета = ВидыДокументовДляПоискаИзМакета.Добавить();
			ВидДокументовДляПоискаИзМакета.ИмяВидаДокумента = ЭлементСоответствия.Ключ;
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементСоответствия Из СоответствиеСвойств Цикл
		Если ЗначениеЗаполнено(ЭлементСоответствия.Ключ)
			И ВидыДокументовДляПоискаИзМакета.Найти(ЭлементСоответствия.Ключ, "ИмяВидаДокумента") = Неопределено Тогда
			ВидДокументовДляПоискаИзМакета = ВидыДокументовДляПоискаИзМакета.Добавить();
			ВидДокументовДляПоискаИзМакета.ИмяВидаДокумента = ЭлементСоответствия.Ключ;
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементСоответствия Из ПереопределениеСвойств Цикл
		Если ЗначениеЗаполнено(ЭлементСоответствия.Ключ)
			И ВидыДокументовДляПоискаИзМакета.Найти(ЭлементСоответствия.Ключ, "ИмяВидаДокумента") = Неопределено Тогда
			ВидДокументовДляПоискаИзМакета = ВидыДокументовДляПоискаИзМакета.Добавить();
			ВидДокументовДляПоискаИзМакета.ИмяВидаДокумента = ЭлементСоответствия.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИмяВидаДокумента КАК ИмяВидаДокумента
		|ПОМЕСТИТЬ ВидыДокументовДляПоискаИзМакета
		|ИЗ
		|	&ВидыДокументовДляПоискаИзМакета КАК ВидыДокументовДляПоискаИзМакета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыДокументовДляПоискаИзМакета.ИмяВидаДокумента КАК ИмяВидаДокумента,
		|	ВидыДокументовГосОргановДляПоиска.Наименование КАК Наименование,
		|	ВидыДокументовГосОргановДляПоиска.Описание КАК Описание,
		|	ВидыДокументовГосОргановДляПоиска.Источник КАК Источник,
		|	ВидыДокументовГосОргановДляПоиска.ТипПолучателя КАК ТипПолучателя,
		|	ВидыДокументовГосОргановДляПоиска.ТипДокумента КАК ТипДокумента,
		|	ВидыДокументовГосОргановДляПоиска.КодДокумента КАК КодДокумента,
		|	ВидыДокументовГосОргановДляПоиска.Синонимы КАК Синонимы,
		|	ВидыДокументовГосОргановДляПоиска.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ВидыДокументовГосОргановДляПоиска.ДатаКонцаДействия КАК ДатаКонцаДействия
		|ИЗ
		|	ВидыДокументовДляПоискаИзМакета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыДокументовГосОргановДляПоиска
		|			КАК ВидыДокументовГосОргановДляПоиска
		|		ПО (ВидыДокументовГосОргановДляПоиска.ИмяВидаДокумента =
		|			ВидыДокументовДляПоискаИзМакета.ИмяВидаДокумента)");
	
	Если НЕ ЗаполнитьЦеликом Тогда
		Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	(ВидыДокументовГосОргановДляПоиска.Источник ЕСТЬ NULL
			|		ИЛИ ВидыДокументовГосОргановДляПоиска.Источник = """")
			|	И (ВидыДокументовГосОргановДляПоиска.ТипПолучателя ЕСТЬ NULL
			|		ИЛИ ВидыДокументовГосОргановДляПоиска.ТипПолучателя =
			|			ЗНАЧЕНИЕ(Перечисление.ТипыКонтролирующихОрганов.ПустаяСсылка))
			|	И (ВидыДокументовГосОргановДляПоиска.ТипДокумента ЕСТЬ NULL
			|		ИЛИ ВидыДокументовГосОргановДляПоиска.ТипДокумента =
			|			ЗНАЧЕНИЕ(Перечисление.ТипыОтправляемыхДокументов.ПустаяСсылка))";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидыДокументовДляПоискаИзМакета", ВидыДокументовДляПоискаИзМакета);
	ВыборкаЗапроса = Запрос.Выполнить();
	
	Если НЕ ЗаполнитьЦеликом И ВыборкаЗапроса.Пустой() Тогда
		//свойства всех описанных в макете элементов заполнены
		Возврат;
	КонецЕсли;
	
	ТаблицаЗапроса = ВыборкаЗапроса.Выгрузить();
	
	СоответствиеКодам = КодВидаОтправляемогоДокументаИлиИсточника();
	
	Для каждого СтрокаТаблицы Из ТаблицаЗапроса Цикл
		ЭтоВидОтправляемыхДокументов = Ложь;
		ЭталонныеСвойства = ПереопределениеСвойств[СтрокаТаблицы.ИмяВидаДокумента];
		Если ЭталонныеСвойства = Неопределено Тогда
			ЭталонныеСвойства = СоответствиеСвойств[СтрокаТаблицы.ИмяВидаДокумента];
			Если ЭталонныеСвойства = Неопределено Тогда
				ЭталонныеСвойства = СоответствиеСвойствВидовОтправляемыхДокументов[СтрокаТаблицы.ИмяВидаДокумента];
				Если ЭталонныеСвойства = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ЭтоВидОтправляемыхДокументов = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ЭталонНаименование = ЭталонныеСвойства.Наименование;
		ЭталонОписание = ЭталонныеСвойства.Описание;
		ЭталонИсточник = ЭталонныеСвойства.Источник;
		ЭталонТипПолучателя = ?(ЗначениеЗаполнено(ЭталонныеСвойства.ТипПолучателя),
			?(ТипЗнч(ЭталонныеСвойства.ТипПолучателя) = Тип("ПеречислениеСсылка.ТипыКонтролирующихОрганов"),
			ЭталонныеСвойства.ТипПолучателя, Перечисления.ТипыКонтролирующихОрганов[ЭталонныеСвойства.ТипПолучателя]), "");
		ЭталонТипДокумента = ?(ЗначениеЗаполнено(ЭталонныеСвойства.ТипДокумента),
			?(ТипЗнч(ЭталонныеСвойства.ТипДокумента) = Тип("ПеречислениеСсылка.ТипыОтправляемыхДокументов"),
			ЭталонныеСвойства.ТипДокумента, Перечисления.ТипыОтправляемыхДокументов[ЭталонныеСвойства.ТипДокумента]), "");
		Если ЭтоВидОтправляемыхДокументов Тогда
			ЭталонныеКоды = СоответствиеКодам[СтрокаТаблицы.ИмяВидаДокумента];
			ЭталонныеКодыПоИсточнику = СоответствиеКодам[ЭталонныеСвойства.Источник];
			ЭталонКодДокумента = ?(ЭталонныеКоды = Неопределено,
				?(ЭталонныеКодыПоИсточнику = Неопределено, "",
					?(ЗначениеЗаполнено(ЭталонныеКодыПоИсточнику.КНД), ЭталонныеКодыПоИсточнику.КНД,
						ЭталонныеКодыПоИсточнику.КодПоОКУД)),
				?(ЗначениеЗаполнено(ЭталонныеКоды.КНД), ЭталонныеКоды.КНД, ЭталонныеКоды.КодПоОКУД));
			ЭталонСинонимы = ?(СтрНайти(ЭталонныеСвойства.Наименование, "-") = 0,
				"", СтрЗаменить(ЭталонныеСвойства.Наименование, "-", ""));
			ЭталонДатаНачалаДействия = '00010101';
			ЭталонДатаКонцаДействия = '00010101';
		Иначе
			ЭталонКодДокумента = ЭталонныеСвойства.КодДокумента;
			ЭталонСинонимы = ЭталонныеСвойства.Синонимы;
			ЭталонДатаНачалаДействия = ДокументооборотСКОВызовСервера.ДатаИзСтрокиРазныхФорматов(
				ЭталонныеСвойства.ДатаНачалаДействия);
			ЭталонДатаКонцаДействия = ДокументооборотСКОВызовСервера.ДатаИзСтрокиРазныхФорматов(
				ЭталонныеСвойства.ДатаКонцаДействия);
		КонецЕсли;
		
		Если СтрокаТаблицы.Наименование <> ЭталонНаименование
			ИЛИ СтрокаТаблицы.Описание <> ЭталонОписание
			ИЛИ СтрокаТаблицы.Источник <> ЭталонИсточник
			ИЛИ СтрокаТаблицы.ТипПолучателя <> ЭталонТипПолучателя
			ИЛИ СтрокаТаблицы.ТипДокумента <> ЭталонТипДокумента
			ИЛИ Строка(СтрокаТаблицы.КодДокумента) <> ЭталонКодДокумента
			ИЛИ Строка(СтрокаТаблицы.Синонимы) <> ЭталонСинонимы
			ИЛИ СтрокаТаблицы.ДатаНачалаДействия <> ЭталонДатаНачалаДействия
			ИЛИ СтрокаТаблицы.ДатаКонцаДействия <> ЭталонДатаКонцаДействия Тогда
			
			НаборЗаписей = РегистрыСведений.ВидыДокументовГосОргановДляПоиска.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИмяВидаДокумента.Установить(СтрокаТаблицы.ИмяВидаДокумента);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ИмяВидаДокумента = СтрокаТаблицы.ИмяВидаДокумента;
			Иначе
				НоваяЗапись = НаборЗаписей[0];
			КонецЕсли;
			
			НоваяЗапись.Наименование = ЭталонНаименование;
			НоваяЗапись.Описание = ЭталонОписание;
			НоваяЗапись.Источник = ЭталонИсточник;
			НоваяЗапись.ТипПолучателя = ЭталонТипПолучателя;
			НоваяЗапись.ТипДокумента = ЭталонТипДокумента;
			НоваяЗапись.КодДокумента = ЭталонКодДокумента;
			НоваяЗапись.Синонимы = ЭталонСинонимы;
			НоваяЗапись.ДатаНачалаДействия = ЭталонДатаНачалаДействия;
			НоваяЗапись.ДатаКонцаДействия = ЭталонДатаКонцаДействия;
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Удаление записей с именами, которых нет в актуальном списке
	ЗапросУдаление = Новый Запрос(
	"ВЫБРАТЬ
	|	ИмяВидаДокумента
	|ИЗ
	|	РегистрСведений.ВидыДокументовГосОргановДляПоиска
	|ГДЕ
	|	ИмяВидаДокумента НЕ В (&АктуальныеИмена)");
	ЗапросУдаление.УстановитьПараметр("АктуальныеИмена",
		ВидыДокументовДляПоискаИзМакета.ВыгрузитьКолонку("ИмяВидаДокумента"));
	ВыборкаУдаление = ЗапросУдаление.Выполнить().Выбрать();
	Пока ВыборкаУдаление.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ВидыДокументовГосОргановДляПоиска.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяВидаДокумента.Установить(ВыборкаУдаление.ИмяВидаДокумента);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Удалить(НаборЗаписей[0]);
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьВидыДокументовГосОргановДляПоиска");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
